[
    {
        "title": "Captain America: Brave New World Official Trailer",
        "image": "https://i.ibb.co.com/tmBYT32/Cap-1.webp",
        "description": "Marvel Studios has unveiled the official trailer for 'Captain America: Brave New World,' marking the next chapter in the superhero saga. The movie continues Sam Wilson's journey as the new Captain America, facing political intrigue and a powerful new enemy. With stunning visuals and high-stakes action, the film promises to be a thrilling addition to the MCU.",
        "trailer": "https://www.youtube.com/watch?v=1pHDWnXmK7Y"
    },
    {
        "title": "Joker: Folie à Deux (2024) Review",
        "image": "https://i.ibb.co.com/bgtgpHW/z0-Jli-Ws8w5-Q2-VUy-NYbj5-Vb-WIlef-1-e1729997502835.webp",
        "description": "'Joker: Folie à Deux' dives deeper into the psyche of Arthur Fleck as his chaotic world intersects with a new partner in crime. The 2024 sequel is a haunting and artistic exploration of mental illness, societal rejection, and the birth of madness. Joaquin Phoenix and Lady Gaga deliver chilling performances in this dark musical drama.",
        "trailer": "https://youtu.be/_OKAwz2MsJs?si=ZGinpLllwoZjcNfe"
    },
    {
        "title": "The Crow (2024) Review",
        "image": "https://i.ibb.co.com/5M90PBy/Crow-1-e1729384247562.webp",
        "description": "The reimagining of 'The Crow' brings the classic story of vengeance and love to a new generation. This 2024 reboot features a gritty, modern take on the iconic character, with breathtaking visuals and a haunting score. A must-watch for fans of dark superhero films.",
        "trailer": "https://youtu.be/djSKp_pwmOA?si=CvtC-WgqoCbEb9N0"
    },
    {
        "title": "Gladiator II Official Trailer 2",
        "image": "https://i.ibb.co.com/L19Gg97/Glad-e1727143731813.webp",
        "description": "The epic saga continues in 'Gladiator II,' as a new generation of warriors steps into the Colosseum. The second official trailer teases grand battles, political intrigue, and a legacy forged in blood. Directed by Ridley Scott, this sequel is set to be a cinematic spectacle.",
        "trailer": "https://youtu.be/4rgYUipGJNo?si=vyvWiBYUbO8Zp-70"
    },
    {
        "title": "Thunderbolts Official Teaser Trailer",
        "image": "https://i.ibb.co.com/G5frXvP/vz-Vojq-W0z-F9-Qr-XVGuj8-Pwhx-WACD-e1727100646146.webp",
        "description": "Marvel Studios introduces 'Thunderbolts,' an ensemble film that brings together a team of anti-heroes and reformed villains. The teaser trailer hints at a gritty, action-packed storyline filled with unexpected alliances and moral ambiguity.",
        "trailer": "https://youtu.be/v-94Snw-H4o?si=uepR43QbnYi4Owb9"
    },
    {
        "title": "Mission: Impossible – The Final Reckoning Official Teaser Trailer",
        "image": "https://i.ibb.co/S300kFR/Mission-Impossible-The-Final-Reckoning-Trailer-Image-01.webp",
        "description": "Our lives are the sum of our choices as Paramount Pictures releases the official teaser trailer for their upcoming action-adventure blockbuster sequel film, Mission: Impossible – The Final Reckoning. This is the 8th entry in the long-running Mission Impossible franchise, which follows Ethan Hunt and his team as they thwart the global threat of a self-aware AI intelligence. Familiar faces return, new characters appear, and it looks to be the biggest adventure yet. I’m excited to see what the eighth installment will bring!",
        "trailer": "https://www.youtube.com/embed/NOhDyUmT9z0?si=sfWEiLnjlV3ht5Q2"
    }
]